Model: "sequential_79"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_252 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_253 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_79 (Dense)             (None, 12)                1548      
=================================================================
Total params: 210,444
Trainable params: 210,444
Non-trainable params: 0
_________________________________________________________________
