Model: "sequential_134"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_97 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_98 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_99 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_36 (Dense)             (None, 48)                6192      
=================================================================
Total params: 346,672
Trainable params: 346,672
Non-trainable params: 0
_________________________________________________________________
