Model: "sequential_83"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_238 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_239 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_240 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_241 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_83 (Dense)             (None, 12)                1548      
=================================================================
Total params: 473,612
Trainable params: 473,612
Non-trainable params: 0
_________________________________________________________________
