Model: "sequential_116"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_42 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_43 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_44 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_18 (Dense)             (None, 24)                1560      
=================================================================
Total params: 89,880
Trainable params: 89,880
Non-trainable params: 0
_________________________________________________________________
