Model: "sequential_121"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_57 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_58 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_59 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_60 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_23 (Dense)             (None, 48)                3120      
=================================================================
Total params: 124,464
Trainable params: 124,464
Non-trainable params: 0
_________________________________________________________________
