Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_17 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_18 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_19 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_20 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_6 (Dense)              (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
