Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_29 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_30 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_11 (Dense)             (None, 12)                396       
=================================================================
Total params: 15,756
Trainable params: 15,756
Non-trainable params: 0
_________________________________________________________________
