Model: "sequential_56"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_163 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_164 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_56 (Dense)             (None, 12)                396       
=================================================================
Total params: 15,756
Trainable params: 15,756
Non-trainable params: 0
_________________________________________________________________
