Model: "sequential_28"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_85 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_86 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_87 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_88 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_28 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
