Model: "sequential_84"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_242 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_243 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_244 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_84 (Dense)             (None, 12)                396       
=================================================================
Total params: 24,076
Trainable params: 24,076
Non-trainable params: 0
_________________________________________________________________
