Model: "sequential_136"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_102 (LSTM)              (None, None, 16)          2496      
_________________________________________________________________
lstm_103 (LSTM)              (None, 16)                2112      
_________________________________________________________________
dense_38 (Dense)             (None, 48)                816       
=================================================================
Total params: 5,424
Trainable params: 5,424
Non-trainable params: 0
_________________________________________________________________
