Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_21 (LSTM)               (None, None, 16)          2496      
_________________________________________________________________
lstm_22 (LSTM)               (None, 16)                2112      
_________________________________________________________________
dense_8 (Dense)              (None, 48)                816       
=================================================================
Total params: 5,424
Trainable params: 5,424
Non-trainable params: 0
_________________________________________________________________
