Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_149 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_150 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_48 (Dense)             (None, 12)                1548      
=================================================================
Total params: 210,444
Trainable params: 210,444
Non-trainable params: 0
_________________________________________________________________
