Model: "sequential_115"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_340 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_341 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_342 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_343 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_115 (Dense)            (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
