Model: "sequential_124"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_68 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_69 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_70 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_26 (Dense)             (None, 48)                3120      
=================================================================
Total params: 91,440
Trainable params: 91,440
Non-trainable params: 0
_________________________________________________________________
