Model: "sequential_122"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_61 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_62 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_63 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_24 (Dense)             (None, 48)                6192      
=================================================================
Total params: 346,672
Trainable params: 346,672
Non-trainable params: 0
_________________________________________________________________
