Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_19 (LSTM)               (None, None, 16)          2496      
_________________________________________________________________
lstm_20 (LSTM)               (None, 16)                2112      
_________________________________________________________________
dense_7 (Dense)              (None, 48)                816       
=================================================================
Total params: 5,424
Trainable params: 5,424
Non-trainable params: 0
_________________________________________________________________
