Model: "sequential_132"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_91 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_92 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_93 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_34 (Dense)             (None, 48)                3120      
=================================================================
Total params: 91,440
Trainable params: 91,440
Non-trainable params: 0
_________________________________________________________________
