Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_45 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_46 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_47 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_14 (Dense)             (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
