Model: "sequential_42"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_136 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_137 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_138 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_42 (Dense)             (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
