Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_7 (LSTM)                (None, None, 16)          2496      
_________________________________________________________________
lstm_8 (LSTM)                (None, None, 16)          2112      
_________________________________________________________________
lstm_9 (LSTM)                (None, 16)                2112      
_________________________________________________________________
dense_3 (Dense)              (None, 12)                204       
=================================================================
Total params: 6,924
Trainable params: 6,924
Non-trainable params: 0
_________________________________________________________________
