Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_26 (LSTM)               (None, None, 16)          2496      
_________________________________________________________________
lstm_27 (LSTM)               (None, None, 16)          2112      
_________________________________________________________________
lstm_28 (LSTM)               (None, 16)                2112      
_________________________________________________________________
dense_10 (Dense)             (None, 48)                816       
=================================================================
Total params: 7,536
Trainable params: 7,536
Non-trainable params: 0
_________________________________________________________________
