Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_9 (LSTM)                (None, None, 64)          22272     
_________________________________________________________________
lstm_10 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_11 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_3 (Dense)              (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
