Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_21 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_22 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_23 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_7 (Dense)              (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
