Model: "sequential_37"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_122 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_123 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_124 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_37 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
