Model: "sequential_131"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_87 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_88 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_89 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_90 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_33 (Dense)             (None, 48)                3120      
=================================================================
Total params: 124,464
Trainable params: 124,464
Non-trainable params: 0
_________________________________________________________________
