Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_24 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_25 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_26 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_8 (Dense)              (None, 12)                396       
=================================================================
Total params: 24,076
Trainable params: 24,076
Non-trainable params: 0
_________________________________________________________________
