Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_10 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_11 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_12 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_3 (Dense)              (None, 24)                792       
=================================================================
Total params: 24,472
Trainable params: 24,472
Non-trainable params: 0
_________________________________________________________________
