Model: "sequential_52"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_166 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_167 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_168 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_169 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_52 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
