Model: "sequential_66"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_210 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_211 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_212 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_213 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_66 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
