Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_10 (LSTM)               (None, None, 16)          2496      
_________________________________________________________________
lstm_11 (LSTM)               (None, None, 16)          2112      
_________________________________________________________________
lstm_12 (LSTM)               (None, None, 16)          2112      
_________________________________________________________________
lstm_13 (LSTM)               (None, 16)                2112      
_________________________________________________________________
dense_4 (Dense)              (None, 48)                816       
=================================================================
Total params: 9,648
Trainable params: 9,648
Non-trainable params: 0
_________________________________________________________________
