Model: "sequential_125"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_71 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_72 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_73 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_74 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_27 (Dense)             (None, 48)                1584      
=================================================================
Total params: 33,584
Trainable params: 33,584
Non-trainable params: 0
_________________________________________________________________
