Model: "sequential_49"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_151 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_152 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_49 (Dense)             (None, 12)                396       
=================================================================
Total params: 15,756
Trainable params: 15,756
Non-trainable params: 0
_________________________________________________________________
