Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_13 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_14 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_15 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_5 (Dense)              (None, 12)                396       
=================================================================
Total params: 24,076
Trainable params: 24,076
Non-trainable params: 0
_________________________________________________________________
