Model: "sequential_36"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_104 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_105 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_106 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_107 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_36 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
