Model: "sequential_85"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_245 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_246 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_247 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_85 (Dense)             (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
