Model: "sequential_81"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_233 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_234 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_235 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_81 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
