Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_13 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_14 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_4 (Dense)              (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
