Model: "sequential_123"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_64 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_65 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_66 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_67 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_25 (Dense)             (None, 48)                1584      
=================================================================
Total params: 33,584
Trainable params: 33,584
Non-trainable params: 0
_________________________________________________________________
