Model: "sequential_130"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_85 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_86 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_32 (Dense)             (None, 48)                3120      
=================================================================
Total params: 58,416
Trainable params: 58,416
Non-trainable params: 0
_________________________________________________________________
