Model: "sequential_100"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_6 (GRU)                  (None, None, 64)          16896     
_________________________________________________________________
gru_7 (GRU)                  (None, None, 64)          24960     
_________________________________________________________________
gru_8 (GRU)                  (None, 64)                24960     
_________________________________________________________________
dense_2 (Dense)              (None, 24)                1560      
=================================================================
Total params: 68,376
Trainable params: 68,376
Non-trainable params: 0
_________________________________________________________________
