Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_9 (LSTM)                (None, None, 16)          2496      
_________________________________________________________________
lstm_10 (LSTM)               (None, None, 16)          2112      
_________________________________________________________________
lstm_11 (LSTM)               (None, None, 16)          2112      
_________________________________________________________________
lstm_12 (LSTM)               (None, 16)                2112      
_________________________________________________________________
dense_3 (Dense)              (None, 24)                408       
=================================================================
Total params: 9,240
Trainable params: 9,240
Non-trainable params: 0
_________________________________________________________________
