Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, None, 64)          22272     
_________________________________________________________________
lstm_7 (LSTM)                (None, 64)                33024     
_________________________________________________________________
dense_3 (Dense)              (None, 24)                1560      
=================================================================
Total params: 56,856
Trainable params: 56,856
Non-trainable params: 0
_________________________________________________________________
