Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, None, 16)          2496      
_________________________________________________________________
lstm_3 (LSTM)                (None, None, 16)          2112      
_________________________________________________________________
lstm_4 (LSTM)                (None, None, 16)          2112      
_________________________________________________________________
lstm_5 (LSTM)                (None, 16)                2112      
_________________________________________________________________
dense_1 (Dense)              (None, 24)                408       
=================================================================
Total params: 9,240
Trainable params: 9,240
Non-trainable params: 0
_________________________________________________________________
