Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_23 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_24 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_25 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_9 (Dense)              (None, 24)                3096      
=================================================================
Total params: 343,576
Trainable params: 343,576
Non-trainable params: 0
_________________________________________________________________
