Model: "sequential_44"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_143 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_144 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_145 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_146 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_44 (Dense)             (None, 12)                780       
=================================================================
Total params: 122,124
Trainable params: 122,124
Non-trainable params: 0
_________________________________________________________________
