Model: "sequential_109"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_320 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_321 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_322 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_323 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_109 (Dense)            (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
