Model: "sequential_69"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_202 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_203 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_204 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_69 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
