Model: "sequential_104"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, None, 64)          22272     
_________________________________________________________________
lstm_7 (LSTM)                (None, None, 64)          33024     
_________________________________________________________________
lstm_8 (LSTM)                (None, 64)                33024     
_________________________________________________________________
dense_6 (Dense)              (None, 24)                1560      
=================================================================
Total params: 89,880
Trainable params: 89,880
Non-trainable params: 0
_________________________________________________________________
