Model: "sequential_49"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_140 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_141 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_142 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_143 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_49 (Dense)             (None, 12)                1548      
=================================================================
Total params: 473,612
Trainable params: 473,612
Non-trainable params: 0
_________________________________________________________________
