Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, None, 128)         77312     
_________________________________________________________________
lstm_7 (LSTM)                (None, None, 128)         131584    
_________________________________________________________________
lstm_8 (LSTM)                (None, None, 128)         131584    
_________________________________________________________________
lstm_9 (LSTM)                (None, 128)               131584    
_________________________________________________________________
dense_2 (Dense)              (None, 12)                1548      
=================================================================
Total params: 473,612
Trainable params: 473,612
Non-trainable params: 0
_________________________________________________________________
