Model: "sequential_106"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_327 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_328 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_329 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_106 (Dense)            (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
