Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_73 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_74 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_75 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_26 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
