Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_13 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_14 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_4 (Dense)              (None, 24)                1560      
=================================================================
Total params: 56,856
Trainable params: 56,856
Non-trainable params: 0
_________________________________________________________________
