Model: "sequential_84"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_269 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_270 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_84 (Dense)             (None, 12)                396       
=================================================================
Total params: 15,756
Trainable params: 15,756
Non-trainable params: 0
_________________________________________________________________
