Model: "sequential_127"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_77 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_78 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_79 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_29 (Dense)             (None, 48)                1584      
=================================================================
Total params: 25,264
Trainable params: 25,264
Non-trainable params: 0
_________________________________________________________________
