Model: "sequential_111"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_340 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_341 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_111 (Dense)            (None, 12)                780       
=================================================================
Total params: 56,076
Trainable params: 56,076
Non-trainable params: 0
_________________________________________________________________
