Model: "sequential_43"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_132 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_133 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_134 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_43 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
