Model: "sequential_133"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_94 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_95 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_96 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_35 (Dense)             (None, 48)                6192      
=================================================================
Total params: 346,672
Trainable params: 346,672
Non-trainable params: 0
_________________________________________________________________
