Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_5 (LSTM)                (None, None, 32)          7040      
_________________________________________________________________
lstm_6 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dense_2 (Dense)              (None, 24)                792       
=================================================================
Total params: 16,152
Trainable params: 16,152
Non-trainable params: 0
_________________________________________________________________
