Model: "sequential_103"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_317 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_318 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_319 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_103 (Dense)            (None, 12)                396       
=================================================================
Total params: 24,076
Trainable params: 24,076
Non-trainable params: 0
_________________________________________________________________
