Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, None, 128)         77312     
_________________________________________________________________
lstm_1 (LSTM)                (None, 128)               131584    
_________________________________________________________________
dense (Dense)                (None, 48)                6192      
=================================================================
Total params: 215,088
Trainable params: 215,088
Non-trainable params: 0
_________________________________________________________________
