Model: "sequential_72"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_230 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_231 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_232 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_233 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_72 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
