Model: "sequential_129"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_82 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_83 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_84 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_31 (Dense)             (None, 48)                3120      
=================================================================
Total params: 91,440
Trainable params: 91,440
Non-trainable params: 0
_________________________________________________________________
