Model: "sequential_37"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_108 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_109 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_110 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_37 (Dense)             (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
