Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_15 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_16 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_17 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_5 (Dense)              (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
