Model: "sequential_107"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_15 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_16 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_17 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_9 (Dense)              (None, 24)                1560      
=================================================================
Total params: 89,880
Trainable params: 89,880
Non-trainable params: 0
_________________________________________________________________
