Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_93 (LSTM)               (None, None, 128)         77312     
_________________________________________________________________
lstm_94 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_95 (LSTM)               (None, None, 128)         131584    
_________________________________________________________________
lstm_96 (LSTM)               (None, 128)               131584    
_________________________________________________________________
dense_30 (Dense)             (None, 12)                1548      
=================================================================
Total params: 473,612
Trainable params: 473,612
Non-trainable params: 0
_________________________________________________________________
