Model: "sequential_52"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_160 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_161 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_52 (Dense)             (None, 12)                1548      
=================================================================
Total params: 210,444
Trainable params: 210,444
Non-trainable params: 0
_________________________________________________________________
