Model: "sequential_120"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_53 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_54 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_55 (LSTM)               (None, None, 32)          8320      
_________________________________________________________________
lstm_56 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_22 (Dense)             (None, 48)                1584      
=================================================================
Total params: 33,584
Trainable params: 33,584
Non-trainable params: 0
_________________________________________________________________
