Model: "sequential_87"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_275 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_276 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_277 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_87 (Dense)             (None, 12)                396       
=================================================================
Total params: 24,076
Trainable params: 24,076
Non-trainable params: 0
_________________________________________________________________
