Model: "sequential_119"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_51 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_52 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_21 (Dense)             (None, 48)                1584      
=================================================================
Total params: 16,944
Trainable params: 16,944
Non-trainable params: 0
_________________________________________________________________
