Model: "sequential_96"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_276 (LSTM)              (None, None, 64)          22272     
_________________________________________________________________
lstm_277 (LSTM)              (None, None, 64)          33024     
_________________________________________________________________
lstm_278 (LSTM)              (None, 64)                33024     
_________________________________________________________________
dense_96 (Dense)             (None, 12)                780       
=================================================================
Total params: 89,100
Trainable params: 89,100
Non-trainable params: 0
_________________________________________________________________
