Model: "sequential_95"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_272 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_273 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_274 (LSTM)              (None, None, 32)          8320      
_________________________________________________________________
lstm_275 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_95 (Dense)             (None, 12)                396       
=================================================================
Total params: 32,396
Trainable params: 32,396
Non-trainable params: 0
_________________________________________________________________
