Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_16 (LSTM)               (None, None, 64)          22272     
_________________________________________________________________
lstm_17 (LSTM)               (None, None, 64)          33024     
_________________________________________________________________
lstm_18 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_6 (Dense)              (None, 48)                3120      
=================================================================
Total params: 91,440
Trainable params: 91,440
Non-trainable params: 0
_________________________________________________________________
