Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_15 (LSTM)               (None, None, 32)          7040      
_________________________________________________________________
lstm_16 (LSTM)               (None, 32)                8320      
_________________________________________________________________
dense_5 (Dense)              (None, 48)                1584      
=================================================================
Total params: 16,944
Trainable params: 16,944
Non-trainable params: 0
_________________________________________________________________
