Model: "sequential_118"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_352 (LSTM)              (None, None, 32)          7040      
_________________________________________________________________
lstm_353 (LSTM)              (None, 32)                8320      
_________________________________________________________________
dense_118 (Dense)            (None, 12)                396       
=================================================================
Total params: 15,756
Trainable params: 15,756
Non-trainable params: 0
_________________________________________________________________
