Model: "sequential_68"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_199 (LSTM)              (None, None, 128)         77312     
_________________________________________________________________
lstm_200 (LSTM)              (None, None, 128)         131584    
_________________________________________________________________
lstm_201 (LSTM)              (None, 128)               131584    
_________________________________________________________________
dense_68 (Dense)             (None, 12)                1548      
=================================================================
Total params: 342,028
Trainable params: 342,028
Non-trainable params: 0
_________________________________________________________________
